#Дано натуральное число. Найдите число десятков в его десятичной записи.
print(int(input()) // 10 % 10)