#	Дано трехзначное число. Найдите сумму его цифр.
print(sum(list(map(int, input()))))