#Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков. Программа получает на вход три числа: a, b, n, и должна вывести два числа: стоимость покупки в рублях и копейках.
print(*(lambda a, b , n: [(n * (100 * a + b)) // 100, (n * (100 * a + b)) % 100])(int(input()), int(input()), int(input())))