#	Значение x вводится с клавиатуры.
#	Вычислите y=(x+1)/(2(1+x^2)).
#	Выведите на экран значения x и y с 3 знаками после запятой. 

print('----------------------------------------')
print('Вычисление по формуле y=(x+1)/(2(1+x^2))')
print('----------------------------------------')
try:
	x = int(input('Введите целое число = x: '))
	print('----------------------------------------')
	y = (x + 1) / (2 * (1 + x ** 2))
	print('Ответ: \nx={:0.3f}\ny={:0.3f}'.format(round(x,3),round(y,3)))
except ValueError:
	print('Вы ввели не число!')