# Напишите программу, которая для введенного n вычисляет значение n! (не использовать функции Python).

print('----------------------------------------')
print('Вычисление факториала n')
print('----------------------------------------')
try:
	n = int(input('Введите n:'))
except Exception:
	print('Произошла ошибка')
else:
	x = 1
	for i in range(1,n+1):
		x = x*i
	print('----------------------------------------')
	print('Факториал из {} = {}'.format(n,x))