# Шоколадка
# Шоколадка имеет вид прямоугольника, разделенного на n×m долек. Шоколадку можно один раз разломить по прямой на две части. Определите, можно ли таким образом отломить от шоколадки часть, состоящую ровно из k долек. Программа получает на вход три числа: n, m, k и должна вывести YES или NO.
print((lambda n,m,k: 'YES' if (n * m >= k and (k % n == 0 or k % m == 0)) else 'NO')(int(input()),int(input()),int(input())))