# Яша плавает в бассейне
# Яша плавал в бассейне размером N × M метров и устал. В этот момент он обнаружил, что находится на расстоянии x метров от одного из длинных бортиков (не обязательно от ближайшего) и y метров от одного из коротких бортиков. Какое минимальное расстояние должен проплыть Яша, чтобы выбраться из бассейна на бортик? Программа получает на вход числа N, M, x, y. Программа должна вывести число метров, которое нужно проплыть Яше до бортика.
print((lambda N,M,x,y: min([x, y, N, M, M - y, N - x]) if N < M else min([x, y, N, M, M - x, N - y]))(int(input()),int(input()),int(input()),int(input())))