text <- "-172.04; -155.8; -185.15; -168.31; NA; NA; -168.17; -201.5; NA; -184.41; -159.85; -157.18; -200.37; -176.42; NA; -185.51; -155.29; -152.51; -137.41; -140.7; -177.31; -198.06; -179.76; NA; -181.7; -185.72; NA; -153.53; -219.77; -194.11; -149.46; NA; NA; -202.8; -156.04; -184.84; -173.34; -172.56; -120.98; -179.19; -170.28; -180.24; -256.1025; -188.11; -178.79; -162.52; -191; -215.09; -204.09; -57.0749999999999; NA; -140.6; -206.79; -201.89; -177.46; -170.21; NA; -166.66; -254.3825; NA; -150.28; -211.69; -119.8; -166.39; NA; -187.78; -168.81; NA; -133.87; -177.69; -170.2; -141.41; -147.87; -194.48; -143.87; -154.62; -187.05; -167.42; -208.48; -156.41; -174.1; -146.8; -184.25; -160.81; -172.32; NA; -156.03; NA; -168.02; NA; -141.33; -180.33; -171.06; -150.98; -168.26; NA; -169.72; -28.7199999999999; -182.45; -212.77; -192.35; -154.74; NA; -171.28; -180.03; -188.13; -156.47; -173.52; -145.56; -143.07; NA; -185.81; -158.54; -151.18; -191.62; -155.83; -174.29; -184.68; -162.44; -159.63; -159.43; NA; NA; -202.87; -216.82; NA; -0.364999999999895; -167.83; -204.65; -191.27; -162.22; -149.73; -155.49; -179.9; -78.6175; -145.69; -183.08; -164.44; NA; -172.49; -162.25; -197.07; -255.56; -139.04; -154.49; -183.53; -178.11; NA; NA; -184.67; -187.73; -163.92; NA; -161.86; -187.66; -171.04; -128.62; NA; -172.69; -168.64; -150.26; -166.49; -212.78; NA; NA; -155.81; NA; NA; -186.48; -157.77; -205.21; -208.44; -153.24; -173.89; -182.8; -156.98; -158.46; NA; -173.3; -173.92; -172.72; -194.24; -168; -206.02; -183.8; -151.5; -176.01; -180.92; -174.71; -211.23; -195.35; -160.37; -178.46; -175.39; -177.25; -191.48; NA; -170.93; -209.77; -148.74; -163.93; -171.26; -179.23; -158.68; NA; -179.05; -181.04; -140.12; -147.49; -190.03; -167.86; -196.34; -149.49; -190.68; -173.84; -214.99; NA; NA; -178.82; NA; -213.18; -155; -161.62; -173.01; -163.02; -185.96; -183.57; NA; -148.59; NA; -135.2; -158.68; NA; -210.8; -185.74; -195.03; -157.15; -154.95; -184.89; -187.06; NA; -182.62; -153.89; -223.92; -183.24; -161.24; -159.31; -179.77; -169.5; NA; -172.97; NA; -155.53; -208.5; -127.08; -138.22; -166.59; -132.71; -138.03; -163.04; -159.4; -145.68; -145.08; -172.24; -175.18; -172.11; -159.44; -165.33; -128.12; -132.44; -71.5575; -133.17; -160.05; NA; -171.39; -120.73; -192.24; -165.76; -146.18; NA; -156.44; -171.64; -136; -169.71; NA; -174.31; -162.63; -181.14; -173.27; -165.37"

library(e1071)
library(DescTools)

convert_text_task_1 <- function(X) {
  results <- list()
  X <- unlist(strsplit(text,"; "))
  X[toupper(X) != tolower(X)] <- NA
  X <- as.double(as.character(X))
  NA_COUNT <- sum(sapply(X, function(y) sum(is.na(y))))
  results$vector <- X
  X <- X[!is.na(X)]
  results$na_count <- NA_COUNT
  results$clear_vector <- X
  return (results)
}

task1 <- convert_text_task_1(text)
object <- task1$clear_vector

task1$na_count # 1. Введите количество пропущенных значений в исходной выборке, обозначенные как "NA"
length(object) # 2. Введите объем очищенной от пропусков выборки
mean(object) # 3. Введите среднее значение
sd(object) # 4. Введите стандартное отклонение (исправленное)
var(object) # 5. Введите несмещенную дисперсию
summary(object)[2] # 6. Введите первую квартиль
summary(object)[5] # 7. Введите третью квартиль
summary(object)[3] # 8. Введите медиану
max(object) # 9. Введите максимальное значение в вариационном ряду
min(object) # 10. Введите минимальное значение в вариационном ряду
max(object) - min(object) # 11. Введите размах выборки
kurtosis(object, type = 2) # 12. Введите эксцесс (формула по умолчанию в Excel)
skewness(object, type = 2) # 13. Введите коэффициент асимметрии (формула по умолчанию в Excel)
(sd(object) / sqrt(length(object))) / sqrt(length(object)) # 14. Введите значение ошибки выборки
MeanCI(object, conf.level = 0.95)[2] # 15. Введите левую границу 0.95-доверительного интервала для E(X)
MeanCI(object, conf.level = 0.95)[3] # 16. Введите правую границу 0.95-доверительного интервала для E(X)
VarCI(object, conf.level = 0.95)[2] # 17. Введите левую границу 0.95-доверительного интервала для Var(X)
VarCI(object, conf.level = 0.95)[3] # 18. Введите правую границу 0.95-доверительного интервала для Var(X)
length(object[object < (quantile(object)["25%"] - 1.5 * IQR(object))]) # 19. Введите количество выбросов ниже нормы
length(object[object < (quantile(object)["75%"] + 1.5 * IQR(object))]) # 20. Введите количество выбросов выше нормы

# 21. Постройте на листе "Лист1" гистограмму и диаграмму "ящик с усиками" для исходной выборки, очищенной от "NA" и выбросов. Если построения произведены в R(RStudio), то скопируйте полученные диаграммы из RStudio на "Лист1".
length(boxplot(object)$out)
length(boxplot(task1$vector[!(task1$vector %in% boxplot(task1$vector)$out)])$out)
