#Дано 10 целых чисел. Вычислите их сумму. Напишите программу, использующую наименьшее число переменных.
print(sum([int(input()) for i in range(10)]))