#Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

print(*	[i for i in range(int(input()), int(input())+1)]) 