#Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, затем вводится ровно N целых чисел. Какое наименьшее число переменных нужно для решения этой задачи?
print(sum([int(input()) for i in range(int(input()))]))
#int(input('Введите число №: ')) 